cncf/apisnoop/arch.org
#+TITLE: Identifying API usage patterns with Applied Anthropology
#+AUTHOR: Hippie Hacker / Zach Mandeville
#+EMAIL: hh@ii.coop / zz@ii.coop
#+CREATOR: ii.coop / CNCF
#+DATE: October 11th, 2018
#+PROPERTY: header-args :dir (file-name-directory buffer-file-name)
#+PROPERTY: header-args:shell :results silent
#+PROPERTY: header-args:shell :exports code
#+PROPERTY: header-args:shell :wrap "SRC text"
#+PROPERTY: header-args:tmux :socket "/tmp/crt-tmate.socket"
#+PROPERTY: header-args:tmux :session crt:main

* Summary

The cultural concepts of mihi and whakapapa are the foundation of this KEP. The
application of these concepts within our community ecosystem deserves a shout
out to the Māori of Aoteroa, Land of the Long White Cloud.

New Zealand hasn’t been populated for very long compared to the rest of the
world. The first people (Māori) arrived on waka (canoes) around the 15th
century. For Maori people today, the name of the specific waka that their
ancestors arrived on, combined with their own genealogical journey defines who
they are (in a very meaningful specific way). When mihi (formal introductions)
are made, they include their own parental lineage back to the name of the waka
their ancestors arrived in. The knowledge and communication of this history
often leads to newly introduced people becoming cognitive of familial historic
connections between them. This concrete and relational definition of identity is
called their whakapapa.

Te Reo/Māori: He mea nui ki a tātau ō tātau whakapapa (HP 1991:1). English: Our
genealogies are important to us.

** Who are you? Why are you here?

Let’s enable any application, using our official Kubernetes libraries and existing CI/Testing infrastructure, to provide data to answer these questions. We need to make room for recording the context for each interaction with the APIServer.

The aggregated clusterwide correlation of identity and user journey with each API request/response would provide the raw metadata necessary to explore the interwoven, but presently unseen, patterns of our user journeys within the Kubernetes community.

* Motivation

We need an atlas of the invisible and undefined tribal patterns within the ecosystem of our community.

This map would help chart our course of development, testing, and conformance based on actual Kubernetes usage patterns.

** Goals

Provide a set of community insights based on publically available data, easily allowing others to create new data or insight.

**** Cross Community - Source code / line level next insights

As a specific line of code (LoC) hits the API server, we will record the LoC
(callstack) that brought it here to articulate that LoC's whakapapa. Combined
with other API requests, we can infer which other LoC utilize and depend on it,
as they hit each endpoint.

Ideally this is across all repos and organizations, and for every binary in a
cluster, eventually linking LoC (and the OWNERS that curate them) througout our
community in a relational way.

**** Kubernetes Endpoint coverage by e2e

Go beyond simple endpoint % hit metrics, providing relational data between
individual tests (and sigs that own them), the endpoints they hit, and the LoC
involved (both server and client side).

**** Common Endpoint journey patterns / suggested test

Analyzing audit / whakapapa logs from multiple applications, suggesting skeleton
tests based on these patterns.

** Non-Goals
*** Define new prow jobs for entire community
I'm hoping to help others write these.

* Proposal

To aggregate identity and purpose _*at the time of API interactions*_, we need:

1. _*The who and why*_ : Define ‘identity’ and ‘purpose’
2. _*App introspection*_ : generated at time of interaction:
3. _*For all apps and the cluster itself*_ : allowing 'global' src, function, and API call mapping

** API interaction Identity (Who are you?)

Current API interaction client-‘identity’ is static and usually set in client-go
via user-agent to something like:

#+NAME: Original user Agent
#+BEGIN_SRC text
e2e.test/v1.12.0 (linux/amd64) kubernetes/b143093
kube-apiserver/v1.12.0 (linux/amd64) kubernetes/b143093
kube-controller-manager/v1.12.0 (linux/amd64) kubernetes/b143093
kubectl/v1.12.0 (linux/amd64) kubernetes/b143093
kubelet/v1.12.0 (linux/amd64) kubernetes/b143093
kube-scheduler/v1.12.0 (linux/amd64) kubernetes/b143093
#+END_SRC

Ideally our base ‘identity’ should at least miminally tie an application back to particular src commit,
though some programs (like kernel info via uname) also show compile time info
like timestamp or build user/machine:

#+NAME: linux kernel telling us about itself
#+BEGIN_SRC 
$ uname -a
Darwin ii.local 10.3.0 Darwin Kernel Version 10.3.0: Fri Oct 26 1:21:00 NZT 1985; root:xnu-1504.3.12~1/RELEASE_I386 i386
#+END_SRC

Possibly something like:

#+NAME: a simple build timestamp similar to linux
#+BEGIN_SRC text
kubelet/v1.12.0 (linux/amd64) k8s.io/kubelet b143093 built by test-infra@buildbot-10 02/03/85 23:44
#+END_SRC

** API interaction Purpose (Why are you here?)

Going beyond a particular build of a source tree into a binary, we must define a
simple to implement, but contextually significant, answer to the question:

*Why are you here?*

Its difficult to glean the purpose of an application interaction by external
inspection without making room for this question.

At the moment of making the API call, the application has access its own stack
and history of source code location/lines and functions that brought it to make
a request of an external API. Disabled by default, it could be enabled by
setting a variable such as `KUBE_CLIENT_SUBMIT_PURPOSE`.

Allowing the application to supply this _‘mental snapshot of purpose’_ could be
as simple as providing space in our protocol for including source and method
callstacks.

