cncf/apisnoop/arch.md


<a id="org65408de"></a>

## Self Identification and Purpose (What does introspection tell you?)

Introspection is available in many of the languages that have official
Kubernetes client libraries.

Go, Python, and Java all provide the ability to inspect the runtime and stack
programmatically, and include source paths and line numbers.

It may help to provide an example introspection:

    "introspection": {
      "self-identity": "kube-apiserver/v1.12.0 (linux/amd64) b143093 compiled by CNCF Fri Feb 26 11:58:09 PST 2010",
      "current-purpose": [
        "k8s.io/client-go/rest.(*Request).Do()",
        "k8s.io/client-go/kubernetes/typed/admissionregistration/v1alpha1.(*initializerConfigurations).List()",
        "k8s.io/apiserver/pkg/admission/configuration.NewInitializerConfigurationManager.func1()",
        "k8s.io/apiserver/pkg/admission/configuration.(*poller).sync()",
        "k8s.io/apiserver/pkg/admission/configuration.sync)-fm()",
        "k8s.io/apimachinery/pkg/util/wait.JitterUntil.func1()",
        "k8s.io/apimachinery/pkg/util/wait.JitterUntil()",
        "k8s.io/apimachinery/pkg/util/wait.Until()",
        "runtime.goexit()"
      ],
      "current-reasoning": [
        "k8s.io/client-go/rest/request.go:807",
        "k8s.io/client-go/kubernetes/typed/admissionregistration/v1alpha1/initializerconfiguration.go:79",
        "k8s.io/apiserver/pkg/admission/configuration/initializer_manager.go:42",
        "k8s.io/apiserver/pkg/admission/configuration/configuration_manager.go:155",
        "k8s.io/apiserver/pkg/admission/configuration/configuration_manager.go:151",
        "k8s.io/apimachinery/pkg/util/wait/wait.go:133",
        "k8s.io/apimachinery/pkg/util/wait/wait.go:134",
        "k8s.io/apimachinery/pkg/util/wait/wait.go:88",
        "runtime/asm_amd64.s:2361"
      ],
    }


<a id="orgfd1224c"></a>

## How do we communicate these larger concepts of identity and purpose?

Currently the freeform concept of identity is limited what can fit within the
user-agent field.

Support for recording the [user-agent field in our
audit-events](<https://github.com/kubernetes/kubernetes/pull/64812>) was recently
added, but our initial explorations depend on that field allowing up to 4k.

For e2e tests, we've added support for sending the test string. However, for a
community wide approach, we'll need to augment client-go to either send the
whakapapa via the request in a optional whakapa field (which would simplify log
collection long term).


<a id="orgfe2c9b9"></a>

## Tying it all together: (How do I turn this on?)

If all applications are compiled against a client-go (or other supported library)
and support the env var \`KUBE<sub>CLIENT</sub><sub>SUBMIT</sub><sub>PURPOSE</sub>\`,
then deploying kubernetes itself with it set should
enable all kubernetes components to begin transmitting identity and purpose.

Setting this variable on all pods could be accomplished with
an admission or initialization controller allowing every binary
run on and within the cluster to do the same.

Currently this data is transmitted via user-agent,
so configuring an audit-logging webhook,
dynamic or otherwise, would allow centralized aggregation.


<a id="org0d6e048"></a>

## Enable communication of 'Who are you?' and 'Why are you here?'


<a id="org9c6e4b1"></a>

### for any application using kubernetes API

Ideally we would like to provide instrumentation to any application talking to kubernetes, not just our e2e test suite.


<a id="org3aa566c"></a>

### via the official protocols and libraries and existing CI Infra

Audit-logging provides a centralized logging mechanism, but we need to make room somewhere for the `whakapapa` style metadata.

This data needs to be available via the job output / gcsweb buckets.

Some options:

1.  Submit whakapapa via API calls params thet show up in the audit-logs

2.  Submit whakapapa hash of some sort via User-Agent (1k limit) => audit-logs


<a id="orge6e38fc"></a>

### Document creation of prow jobs and resulting artifacts buckets for inclusion.

Jobs need to be configured to generate at least audit logs, in a predefined location, and possible whakapapa audit/hash logs.


<a id="org243bb31"></a>

## User Stories


<a id="orgff5fa15"></a>

### SIG Component 'end-user' identification and usage patterns

As a SIG member, who uses the components we curate and what are they doing with them?


<a id="org1429e86"></a>

### SIG informed test writing / conformance patterns

As a SIG member choosing test to write/upgrade to conformance tests,
what patterns and endpoints occur within our community vs what we currently test for.


<a id="org932b08e"></a>

### Developer with a relational / community view

As a developer, I'd like to know the existing tests and applications
that have similar patterns or hit the endpoints I'm interested in.


<a id="org1a740d0"></a>

## Implementation Details/Notes/Constraints


<a id="org7e16386"></a>

## Risks and Mitigations


<a id="orge78f2d7"></a>

# Implementation History

-   06/27/2018: initial design via google doc
-   07/11/2018: submission of KEP
-   07/??/2018: sponsorship by sig-????


<a id="org9772320"></a>

# Alternatives [optional]


<a id="org290f970"></a>

## Record the audit-id + whakapa and a file that gets uploaded to GCS

If we instrument applications by having them write audit-id + whakapa to lags,
we would need to ensure they end of in the GCS bucket, and it would now allow
dynamic audit configuration as a method.


<a id="org873b063"></a>

# Our own Context (scratch)

simple summary of purpose: 'With data that provides the context of usage of kubernetes api (who is using it, where are they coming from, why are they doing this?), we can begin to visualize patterns of usage for kubernetes that will help us chart our course of development, testing, and conformance that's based on actual Kubernetes usage.   Through this, the k8s community (and conformance group) can  prioritize what endpoints are being tested, or which ones need more attention.  It will also help the community better understand who among them are working on which things, and why."

This summary has some inherent stages: 

-   data being provided to us
-   that data having usage context
-   us having a way to share this to the k8s community.
-   There is a feedback loop
-   Our sharing being presented in a meaningful and inviting way for the community.

it's not about just making moreo tests, what are we testing on?  We can make tests that pass, but they may not be 'meaningful tests'.  If conformance is k8s figuring itself out, what things conform to our definition of ourselves, then meaning comes from who *we* are, what *we* are doing that k8s is conforming to.
