cncf/apisnoop/arch.org
** [100%] Questions for our discussion
  - [X] Is this summary correct for apisnoop?
  - [X] Are the stages accurate?
  - [X]  If this is true, then what stage are we in right now?
    - Right now we are only running this for a single user, the e2e test suite.  And for this beginning version, that is enough.  And so we can say that we are having data provided to us, and so we are past stage 1.
    - Even at this point, new questions emerged when we shared findings to sig-testing:  Can we filter based on test name?  IF we drop down into a sig, what does it mean to see a sig within a test.  It's based on labels.  Can we filter by labels then?
    - This sharing of our initial interface was step 3, but the sharing engendered not only  new questions about how we are grabbing data and its context, but also questions for //how we are allowing for people to explore the data and ask questions of this data.//
  - [X] Do we have step 1 and 2 accomplished?  Do we need to have them accomplished before we try to share step 3?
    - These may be different steps, but they are not linear.  Work done on step 3 enables more questions to be asked about the data and what context it has.  In other words, step 3 feeds back into step 1 and 2 and the way it feeds back generates new demands for step 3.  It is a cycle.  A stronger base for 3 will create a stronger base for 1 and 2 which in turns will create an even STRONGER base for 3.
  - [X] If not, what have we done and what are we doing to accomplish this?
    - We are refactoring the web interface to tighten our iteration loop, and be able to respond more quickly with the suggestions of the community for how they want to explore the data.
    - We are strategizing for how the data comes in, and how we can combine existing information into a single source to draw from, a source that is now more meaningful for the context it brings in.  In other words, we can pull audit logs fro test grid, and these audit logs will name the SIG or test_group this job is a part of...but it won't give further context about either.  This further context can be found in yaml files distributed across our git repos, but it can take some sleuthing and heavy brain work to remember where to find them, and how they all interrelate.  We are building a backend that does that sleuthing and combining for us--so that we can start to do the higher-level patterns instead of just searching out and keeping track of the raw data.
  - [X] How many of these stages are within the domain of apisnoop work, and how much is assumed to be handled by someone else?
    - Auditing has to be configured and it's a pain in the butt right now.
    - There's a new feature called 'dyanmic audit configuration' that made this easier.  We didn't ask them to do this, but it came within 4 hours of our KEP.  And so the vision we are bringing forward new features of kubernetes through the vision provided in our long-term strategies.  In other words, we are helping define what kubernetes  is--and so the 'soft work' is directly contributing to conformance.
    - So this dynamic auditing is going to help us bring in the data that will inform our web interface.
    - In other words, a dropdown filter asumes there is data to filter upon and context in which to build the dropdown options.  It also assumes that we can grab this data and context quickly.  We are doing work to make both of these assumptions trueo

*** our architecture is made up of: 

- the existing work of test-infra.  
  - We lean heavily on prow
  - job results 
  - the test grid config (mostly to find which buckets to pull from).
- we are creating a workflow pipeline of prow => gcsbucket to quickly iterate over data creation
- we are creating an extensible data-processing and visualization platform
  - made up of modular components
  - Easier to respond to community requests and build out new visualizations and features
  - data processing has a clear api to draw from to pull out consistent data for our visualizations.
a stable and extensible.
  - [ ] If there is no known handler, than do these tasks become a part of our work and architecture?

The feedback loop is an important part of our purpose, to share this with conformance and sig-testing and see what sort of patterns are meaningful to them.  With the earliest versions, we already had useful feedback for what it is they'd like to do.  They want to interact with real data, and they want to be able to filter the data on some dynamic points and take actions from these.  The actions would be 'suggest tests' and 'suggest areas that are critically untested, and so endpoints within that area to be tested', 'suggest existing tests that do meaningful things that promote conformance', 'suggest meaningful ways the community is using the api and emerging patterns.'

This made us realize that we'd need to tighten our own iteration loop for the web interface, to better respond to the feedback around filters and actions.  The first version was not easily extensible, and required extensive manual work to update the page and add in new features.  And so we are working to build a more exensible backend for our interface, to be able to provide the actionable filters and insights.  This is already known as a need, but we are saying this is also a primary strategy for how we work.  The refactoring to create a tighter iteration loop is crucial for how we bring in data, and how we add context to that data.  * Objective 

In order to provide conformance metrics and actionable data to the CNCF
Conformance WG, we want to continuously utilize the output from our conformance
related prow-jobs.

Starting with the jobs displayed via test-grid/conformance-gce, we want to
create analysis and visualization tools to understand:


- what tests hit which endpoints
- what percentage of endpoints are hit (over time)
- how our community using the k8s api
- ???

Afterwards, we will combine Kubernetes application tests from across the CNCF
and beyond, to analyze real world usage patterns. This data will be used to see
patterns of usage and suggest new tests.
* Design

Using various methods to create and capture more context around API communications,
we will ensure that the artifacts pushed by prow jobs contain the information necessary
to drive deeper analysis.

Conformance related jobs (and their artifacts) will be pulled for analysis and
visualization. Anyone should be able to fork and bring up their own analysis and
contribute.

* Goals 

- Build a simple api to provide access, analysis of prow job output/data
- Create a process to quickly iterate on development of new jobs (destined for prow.k8s.io)
- Add features to combine and visualize output across multiple jobs and buckets
- Generate actionable conformance coverage reports / test suggestions

* Conformance Jobs

** Prow Job Definitions

Prow jobs are defined in subfolders of [[https://github.com/kubernetes/test-infra/tree/master/config/jobs][k8s/test-infra/config/jobs]] though most of
the conformance-gce jobs seem to be part of [[https://github.com/kubernetes/community/tree/master/sig-gcp][sig-gcp]] as they are under
[[https://github.com/kubernetes/test-infra/blob/master/config/jobs/kubernetes/sig-gcp/][config/jobs/kubernetes/sig-gcp]] in [[https://github.com/kubernetes/test-infra/blob/master/config/jobs/kubernetes/sig-gcp/gce-conformance.yaml][gce-conformance.yaml]]

So far the conforance-gce jobs seem to be configured to run every 6 hours and
take about 2 hours to run.

