cncf/apisnoop/arch.md


<a id="org3b9e344"></a>

## Results Uploaded to [GCS Buckets](https://cloud.google.com/storage/docs/json_api/v1/buckets)

I'm unsure where it's configured, but `kubernetes-jenkins/logs` is prepended to
`<job name>` for all prow.k8s.io jobs.

[gcsupload](https://github.com/kubernetes/test-infra/blob/master/prow/cmd/gcsupload/README.md) or [jenkins/bootstrap.py#upload<sub>artifacts</sub>()](https://github.com/kubernetes/test-infra/blob/master/jenkins/bootstrap.py#L397) is likely responsible for this work.


<a id="org7f528d4"></a>

# Conformance Results


<a id="org80daa7c"></a>

# Existing Conformance Dashboards (test-grid)

We focused on the [k8s-testgrid/conformance-gce](https://k8s-testgrid.appspot.com/conformance-gce) and it's tabs.

-   [GCE, master (dev)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520master%2520(dev))
-   [GCE, v1.12 (dev)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.12%2520(dev))
-   [GCE, v1.11 (dev)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.11%2520(dev))
-   [GCE, v1.10 (dev)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.10%2520(dev))
-   [GCE, v1.9  (dev)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.9%2520(dev))

-   [GCE, v1.12 (release)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.12%2520(release))
-   [GCE, v1.11 (release)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.11%2520(release))
-   [GCE, v1.10 (release)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.10%2520(release))
-   [GCE, v1.9  (release)](https://k8s-testgrid.appspot.com/conformance-gce#GCE,%2520v1.9%2520(release))


<a id="org68bc530"></a>

## Dashboard Definitions

Dashboards are configured via [k8s/test-infra/testgrid/config.yaml#Prow hosted
conformance tests](https://github.com/kubernetes/test-infra/blob/master/testgrid/config.yaml#L3014) and are configured in a bit of a higherarchy.


<a id="orga82e213"></a>

### dashboard<sub>groups</sub>: [conformance](https://github.com/kubernetes/test-infra/blob/f3b96c7fcf9ef6b0411dc126e42a1618c1524187/testgrid/config.yaml#L7430)

    - name: conformance
      dashboard_names:
      - conformance-all
      - conformance-gce


<a id="org3d45efb"></a>

### dashboards: [conformance-gce](https://github.com/kubernetes/test-infra/blob/f3b96c7fcf9ef6b0411dc126e42a1618c1524187/testgrid/config.yaml#L3373)

    - name: conformance-gce
      dashboard_tab:
      - name: GCE, master (dev)
        description: Runs conformance tests using kubetest against latest kubernetes master CI build on GCE
        test_group_name: ci-kubernetes-gce-conformance
      - name: GCE, v1.12 (release)
        description: Runs conformance tests using kubetest against kubernetes release 1.12 stable tag on GCE
        test_group_name: ci-kubernetes-gce-conformance-stable-1-12
        # TODO(bentheelder): there's probably a more appropriate alias to alert this to
        alert_options:
          alert_mail_to_addresses: gke-kubernetes-engprod+alerts@google.com
      - name: GCE, v1.12 (dev)
        description: Runs conformance tests using kubetest against kubernetes release 1.12 branch on GCE
        test_group_name: ci-kubernetes-gce-conformance-latest-1-12


<a id="orgfedadfe"></a>

### test<sub>groups</sub>: [ci-kubernetes-gce-conformance-\*](https://github.com/kubernetes/test-infra/blob/f3b96c7fcf9ef6b0411dc126e42a1618c1524187/testgrid/config.yaml#L3014)

    # Prow hosted conformance tests
    - name: ci-kubernetes-gce-conformance
      gcs_prefix: kubernetes-jenkins/logs/ci-kubernetes-gce-conformance
      num_columns_recent: 3
      alert_stale_results_hours: 24
      num_failures_to_alert: 1
    - name: ci-kubernetes-gce-conformance-stable-1-12
      gcs_prefix: kubernetes-jenkins/logs/ci-kubernetes-gce-conformance-stable-1-12
      num_columns_recent: 3
      alert_stale_results_hours: 24
      num_failures_to_alert: 1
    - name: ci-kubernetes-gce-conformance-latest-1-12
      gcs_prefix: kubernetes-jenkins/logs/ci-kubernetes-gce-conformance-latest-1-12

Testgrid provides a webui around job results stored in gubernator / gcsweb.

We don't directly interact with testgrid, but we use the [config](https://github.com/kubernetes/test-infra/blob/master/testgrid/config.yaml#L3014) to find the
correct gcs<sub>prefixes</sub>. 

Testgrid provides a webui around job results stored in gubernator / gcsweb.

We don't directly interact with testgrid, but we use the [config](https://github.com/kubernetes/test-infra/blob/master/testgrid/config.yaml#L3014) to find the
correct gcs<sub>prefixes</sub>. 


<a id="orgf3fa954"></a>

# K8s e2e Conformance Jobs

Our focus in to take 

They are configured via
[k8s/test-infra/testgrid/config.yaml#Prow hosted conformance tests](https://github.com/kubernetes/test-infra/blob/master/testgrid/config.yaml#3014) and all have  

testgrid provides a webui around job results stored in gubernator / gcsweb.

We don't directly interact with testgrid, but we use the [config](https://github.com/kubernetes/test-infra/blob/master/testgrid/config.yaml#L3014) to find the
correct gcs<sub>prefixes</sub>. Currently we filter on testgroup 

We iterate over

dashboards[conformance-gce].dashboard<sub>tab</sub>[x].test<sub>group</sub><sub>name</sub>
test<sub>groups</sub>[Z].gcs<sub>prefix</sub>

Then we prepend gcsweb.k8s.io/gcs

Each test<sub>group</sub> pulls from a specific gcs<sub>prefix</sub>.

Jobs are defined at [k8s/test-infra/jobs](https://github.com/kubernetes/test-infra/tree/master/config/jobs) though most of the conformance dashboard are at
[config/jobs/kubernetes/sig-gcp/gce-conformance.yaml](https://github.com/kubernetes/test-infra/blob/master/config/jobs/kubernetes/sig-gcp/gce-conformance.yaml)

 most of our conformance jobs
have a periodic run of about 6 hours. It takes usually takes 2 hours for them to
run.


<a id="orgca69163"></a>

## Where does kubetest download like ci-latest


<a id="orge3f9e65"></a>

## kubekins

Everything runs under kubekins

<https://github.com/kubernetes/test-infra/tree/master/images/kubekins-e2e>
<https://github.com/kubernetes/test-infra/tree/master/images/kubekins-test>

gcr.io/k8s-testimages/kubekins-e2e-prow

[gcr/images/k8s-testimages/GLOBAL/kubekins-e2e-prow](https://console.cloud.google.com/gcr/images/k8s-testimages/GLOBAL/kubekins-e2e-prow?pli=1)

